9/data/attachments/ebb0ed1146aee6a9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fd4d70fd-2839-401b-a404-14d329288601</nif:username>
            <nif:friendToBeAdded>Brandon_mouth_Friend_82132_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>